app/views/stores/index.html.erb

SELECT `stores`.* FROM `stores`
SELECT `items`.* FROM `items`
---
<script>
    $(document).ready(function () {
        $.ajax({
            url: "/stores/show",
            method: "GET",
            dataType: "json",
            data: {
                store: $("#stores").val(),
                item_name: $("#items_name").val(),
                item_color: $("#items_color").val(),
                item_size: $("#items_size").val()
            },
            success: function (response) {
                var all_items = response["all_items"];
                for(var index = 0; index < all_items["store"].length; index++){
                    $("#stores").append('<option>' + all_items["store"][index] + '</option>');
                }
                document.getElementById('stores').selectedIndex  = 0;
                for(var index = 0; index < all_items["items"].length; index++){
                    $("#items_name").append('<option>' + all_items["items"][index] + '</option>');
                }
                document.getElementById('items_name').selectedIndex  = 0;