lib/get_unique_values_by_given_count.rb

SELECT `items`.`id` FROM `items`
SELECT MIN(`items`.`id`) FROM `items`
---
  def generate_original_array
    original_array = []
    item_ids_list = Item.pluck(:id)
    (1..COUNT_OF_VALUES_RANDOM_ARRAY).each do
      original_array << item_ids_list[rand(0..item_ids_list.length-1)]

SELECT `stores`.* FROM `stores`
INSERT INTO `store_items` (`quantity`, `item_id`, `store_id`, `created_at`, `updated_at`) VALUES (44, 360, 5, '2020-03-11 11:43:02.798676', '2020-03-11 11:43:02.798676')
---
  def output_stores
    stores = Store.all
    stores.each do |store|
      uniqe_ids_array = generate_output
      uniqe_ids_array.each do |element|
        new_store_item = StoreItem.new
        new_store_item.quantity = rand(1..100)
        new_store_item.item_id = element
        new_store_item.store_id = store.id
        new_store_item.save