app/controllers/stores_controller.rb

SELECT DISTINCT `items`.`name` FROM `items`
SELECT DISTINCT `items`.`color` FROM `items`
SELECT DISTINCT `items`.`size` FROM `items`
SELECT `items`.`id` FROM `items` WHERE `items`.`name` IS NULL AND `items`.`size` IS NULL AND `items`.`color` IS NULL
SELECT `store_items`.`id` FROM `store_items` WHERE `store_items`.`store_id` = 10 AND `store_items`.`item_id` = 168
SELECT `store_items`.`quantity` FROM `store_items` WHERE `store_items`.`store_id` = 7 AND 1=0
---
  def show
    all_items = {}
    all_items['store'] = Store.distinct.pluck(:name)
    all_items['items'] = Item.distinct.pluck(:name)
    all_items['color'] = Item.distinct.pluck(:color)
    all_items['size'] = Item.distinct.pluck(:size)

    @condition = {}
    if params[:store].present?
      @selected_store = Store.distinct.where(name: params[:store]).pluck(:id)
      @items_selected_store = StoreItem.where(store_id: @selected_store).pluck(:item_id)
    end
    if params[:item_name].present?
      @condition['name'] = params[:item_name]
    end
    if params[:item_color].present?
      @condition['color'] = params[:item_color]
    end
    items_result = {}
    items_result['items'] = Item.distinct.where(@condition, id: @items_selected_store).pluck(:name)
    items_result['color'] = Item.distinct.where(@condition, id: @items_selected_store).pluck(:color)
    items_result['size'] = Item.distinct.where(@condition, id: @items_selected_store).pluck(:size)

    selected_item = Item.where(name: params[:item_name], size: params[:item_size], color: params[:item_color]).pluck(:id)
    quantity_current_item = StoreItem.where(:store_id => @selected_store, :item_id => selected_item).pluck(:quantity)